### Project Name :				"128-point FFT"
### Author:							"N. V. Kvashina"
### Technology:					"X-FAB 180 nm CMOS, XT018 1243"
### Library:						"D_CELLS_HD, 1.8V"
### Tools:							"Cadence RTL Compiler"
###
### Stage:							"Synthesis"
### File description:			"Contains commands for RTL Compiler"
###
### Work directory:				"Digital_ASIC/RTL_Compiler"
### Run command:					"RTL_Compiler ../Scripts/FFT_syn.tcl"

## Setup technology files
include ../Scripts/XFAB_typ.tcl

# Setup variables
set DESIGN FFTblock_FP_libblocks
set PARAMS {}

## Read in Verilog HDL files
# Subsystem modules for fast calculation of complex numbers
read_hdl -v2001 ../Source/Subsystem.v
read_hdl -v2001 ../Source/Subsystem1.v
read_hdl -v2001 ../Source/Subsystem1_block.v
read_hdl -v2001 ../Source/Subsystem1_block1.v
read_hdl -v2001 ../Source/Subsystem1_block2.v
read_hdl -v2001 ../Source/Subsystem1_block3.v
read_hdl -v2001 ../Source/Subsystem1_block4.v
read_hdl -v2001 ../Source/Subsystem1_block5.v
read_hdl -v2001 ../Source/Subsystem1_block6.v
read_hdl -v2001 ../Source/Subsystem1_block7.v
read_hdl -v2001 ../Source/Subsystem1_block8.v
read_hdl -v2001 ../Source/Subsystem1_block9.v
read_hdl -v2001 ../Source/Subsystem1_block10.v
read_hdl -v2001 ../Source/Subsystem1_block11.v
read_hdl -v2001 ../Source/Subsystem1_block12.v
read_hdl -v2001 ../Source/Subsystem1_block13.v
read_hdl -v2001 ../Source/Subsystem1_block14.v
read_hdl -v2001 ../Source/Subsystem1_block15.v
read_hdl -v2001 ../Source/Subsystem1_block16.v
read_hdl -v2001 ../Source/Subsystem1_block17.v
read_hdl -v2001 ../Source/Subsystem1_block18.v
read_hdl -v2001 ../Source/Subsystem1_block19.v
read_hdl -v2001 ../Source/Subsystem1_block20.v
read_hdl -v2001 ../Source/Subsystem1_block21.v
read_hdl -v2001 ../Source/Subsystem1_block22.v
read_hdl -v2001 ../Source/Subsystem1_block23.v
read_hdl -v2001 ../Source/Subsystem1_block24.v
read_hdl -v2001 ../Source/Subsystem1_block25.v
read_hdl -v2001 ../Source/Subsystem1_block26.v
read_hdl -v2001 ../Source/Subsystem1_block27.v
read_hdl -v2001 ../Source/Subsystem1_block28.v
read_hdl -v2001 ../Source/Subsystem1_block29.v
read_hdl -v2001 ../Source/Subsystem1_block30.v
read_hdl -v2001 ../Source/Subsystem1_block31.v
read_hdl -v2001 ../Source/Subsystem1_block32.v
read_hdl -v2001 ../Source/Subsystem1_block33.v
read_hdl -v2001 ../Source/Subsystem1_block34.v
read_hdl -v2001 ../Source/Subsystem1_block35.v
read_hdl -v2001 ../Source/Subsystem1_block36.v
read_hdl -v2001 ../Source/Subsystem1_block37.v
read_hdl -v2001 ../Source/Subsystem1_block38.v
read_hdl -v2001 ../Source/Subsystem1_block39.v
read_hdl -v2001 ../Source/Subsystem1_block40.v
read_hdl -v2001 ../Source/Subsystem1_block41.v
read_hdl -v2001 ../Source/Subsystem1_block42.v
read_hdl -v2001 ../Source/Subsystem1_block43.v
read_hdl -v2001 ../Source/Subsystem1_block44.v
read_hdl -v2001 ../Source/Subsystem1_block45.v
read_hdl -v2001 ../Source/Subsystem1_block46.v
read_hdl -v2001 ../Source/Subsystem1_block47.v
read_hdl -v2001 ../Source/Subsystem1_block48.v
read_hdl -v2001 ../Source/Subsystem1_block49.v
read_hdl -v2001 ../Source/Subsystem1_block50.v
read_hdl -v2001 ../Source/Subsystem1_block51.v
read_hdl -v2001 ../Source/Subsystem1_block52.v
read_hdl -v2001 ../Source/Subsystem1_block53.v
read_hdl -v2001 ../Source/Subsystem1_block54.v
read_hdl -v2001 ../Source/Subsystem1_block55.v
read_hdl -v2001 ../Source/Subsystem1_block56.v
read_hdl -v2001 ../Source/Subsystem1_block57.v
read_hdl -v2001 ../Source/Subsystem1_block58.v
read_hdl -v2001 ../Source/Subsystem1_block59.v
read_hdl -v2001 ../Source/Subsystem1_block60.v
read_hdl -v2001 ../Source/Subsystem1_block61.v
read_hdl -v2001 ../Source/Subsystem1_block62.v
read_hdl -v2001 ../Source/Subsystem1_block63.v
read_hdl -v2001 ../Source/Subsystem1_block64.v
read_hdl -v2001 ../Source/Subsystem1_block65.v
read_hdl -v2001 ../Source/Subsystem1_block66.v
read_hdl -v2001 ../Source/Subsystem1_block67.v
read_hdl -v2001 ../Source/Subsystem1_block68.v
read_hdl -v2001 ../Source/Subsystem1_block69.v
read_hdl -v2001 ../Source/Subsystem1_block70.v
read_hdl -v2001 ../Source/Subsystem1_block71.v
read_hdl -v2001 ../Source/Subsystem1_block72.v
read_hdl -v2001 ../Source/Subsystem1_block73.v
read_hdl -v2001 ../Source/Subsystem1_block74.v
read_hdl -v2001 ../Source/Subsystem1_block75.v
read_hdl -v2001 ../Source/Subsystem1_block76.v
read_hdl -v2001 ../Source/Subsystem1_block77.v
read_hdl -v2001 ../Source/Subsystem1_block78.v
read_hdl -v2001 ../Source/Subsystem1_block79.v
read_hdl -v2001 ../Source/Subsystem1_block80.v
read_hdl -v2001 ../Source/Subsystem1_block81.v
read_hdl -v2001 ../Source/Subsystem1_block82.v
read_hdl -v2001 ../Source/Subsystem1_block83.v
read_hdl -v2001 ../Source/Subsystem1_block84.v
read_hdl -v2001 ../Source/Subsystem1_block85.v
read_hdl -v2001 ../Source/Subsystem1_block86.v
read_hdl -v2001 ../Source/Subsystem1_block87.v
read_hdl -v2001 ../Source/Subsystem1_block88.v
read_hdl -v2001 ../Source/Subsystem1_block89.v
read_hdl -v2001 ../Source/Subsystem1_block90.v
read_hdl -v2001 ../Source/Subsystem1_block91.v
read_hdl -v2001 ../Source/Subsystem1_block92.v
read_hdl -v2001 ../Source/Subsystem1_block93.v
read_hdl -v2001 ../Source/Subsystem1_block94.v
read_hdl -v2001 ../Source/Subsystem1_block95.v
read_hdl -v2001 ../Source/Subsystem1_block96.v
read_hdl -v2001 ../Source/Subsystem1_block97.v
read_hdl -v2001 ../Source/Subsystem1_block98.v
read_hdl -v2001 ../Source/Subsystem1_block99.v
read_hdl -v2001 ../Source/Subsystem1_block100.v
read_hdl -v2001 ../Source/Subsystem1_block101.v
read_hdl -v2001 ../Source/Subsystem1_block102.v
read_hdl -v2001 ../Source/Subsystem1_block103.v
read_hdl -v2001 ../Source/Subsystem1_block104.v
read_hdl -v2001 ../Source/Subsystem1_block105.v
read_hdl -v2001 ../Source/Subsystem1_block106.v
read_hdl -v2001 ../Source/Subsystem1_block107.v
read_hdl -v2001 ../Source/Subsystem1_block108.v
read_hdl -v2001 ../Source/Subsystem1_block109.v
read_hdl -v2001 ../Source/Subsystem1_block110.v
read_hdl -v2001 ../Source/Subsystem1_block111.v
read_hdl -v2001 ../Source/Subsystem1_block112.v
read_hdl -v2001 ../Source/Subsystem1_block113.v
read_hdl -v2001 ../Source/Subsystem1_block114.v
read_hdl -v2001 ../Source/Subsystem1_block115.v
read_hdl -v2001 ../Source/Subsystem1_block116.v
read_hdl -v2001 ../Source/Subsystem1_block117.v
read_hdl -v2001 ../Source/Subsystem1_block118.v
read_hdl -v2001 ../Source/Subsystem1_block119.v
read_hdl -v2001 ../Source/Subsystem1_block120.v
read_hdl -v2001 ../Source/Subsystem1_block121.v
read_hdl -v2001 ../Source/Subsystem1_block122.v
read_hdl -v2001 ../Source/Subsystem1_block123.v
read_hdl -v2001 ../Source/Subsystem1_block124.v
read_hdl -v2001 ../Source/Subsystem1_block125.v
read_hdl -v2001 ../Source/Subsystem1_block126.v
read_hdl -v2001 ../Source/Subsystem1_block127.v
read_hdl -v2001 ../Source/Subsystem1_block128.v
read_hdl -v2001 ../Source/Subsystem1_block129.v
read_hdl -v2001 ../Source/Subsystem1_block130.v
read_hdl -v2001 ../Source/Subsystem1_block131.v
read_hdl -v2001 ../Source/Subsystem1_block132.v
read_hdl -v2001 ../Source/Subsystem1_block133.v
read_hdl -v2001 ../Source/Subsystem1_block134.v
read_hdl -v2001 ../Source/Subsystem1_block135.v
read_hdl -v2001 ../Source/Subsystem1_block136.v
read_hdl -v2001 ../Source/Subsystem1_block137.v
read_hdl -v2001 ../Source/Subsystem1_block138.v
read_hdl -v2001 ../Source/Subsystem1_block139.v
read_hdl -v2001 ../Source/Subsystem1_block140.v
read_hdl -v2001 ../Source/Subsystem1_block141.v
read_hdl -v2001 ../Source/Subsystem1_block142.v
read_hdl -v2001 ../Source/Subsystem1_block143.v
read_hdl -v2001 ../Source/Subsystem1_block144.v
read_hdl -v2001 ../Source/Subsystem1_block145.v
read_hdl -v2001 ../Source/Subsystem1_block146.v
read_hdl -v2001 ../Source/Subsystem1_block147.v
read_hdl -v2001 ../Source/Subsystem1_block148.v
read_hdl -v2001 ../Source/Subsystem1_block149.v
read_hdl -v2001 ../Source/Subsystem1_block150.v
read_hdl -v2001 ../Source/Subsystem1_block151.v
read_hdl -v2001 ../Source/Subsystem1_block152.v
read_hdl -v2001 ../Source/Subsystem1_block153.v
read_hdl -v2001 ../Source/Subsystem1_block154.v
read_hdl -v2001 ../Source/Subsystem1_block155.v
read_hdl -v2001 ../Source/Subsystem1_block156.v
read_hdl -v2001 ../Source/Subsystem1_block157.v
read_hdl -v2001 ../Source/Subsystem1_block158.v
read_hdl -v2001 ../Source/Subsystem1_block159.v
read_hdl -v2001 ../Source/Subsystem1_block160.v
read_hdl -v2001 ../Source/Subsystem1_block161.v
read_hdl -v2001 ../Source/Subsystem1_block162.v
read_hdl -v2001 ../Source/Subsystem1_block163.v
read_hdl -v2001 ../Source/Subsystem1_block164.v
read_hdl -v2001 ../Source/Subsystem1_block165.v
read_hdl -v2001 ../Source/Subsystem1_block166.v
read_hdl -v2001 ../Source/Subsystem1_block167.v
read_hdl -v2001 ../Source/Subsystem1_block168.v
read_hdl -v2001 ../Source/Subsystem1_block169.v
read_hdl -v2001 ../Source/Subsystem1_block170.v
read_hdl -v2001 ../Source/Subsystem1_block171.v
read_hdl -v2001 ../Source/Subsystem1_block172.v
read_hdl -v2001 ../Source/Subsystem1_block173.v
read_hdl -v2001 ../Source/Subsystem1_block174.v
read_hdl -v2001 ../Source/Subsystem1_block175.v
read_hdl -v2001 ../Source/Subsystem1_block176.v
read_hdl -v2001 ../Source/Subsystem1_block177.v
read_hdl -v2001 ../Source/Subsystem1_block178.v
read_hdl -v2001 ../Source/Subsystem1_block179.v
read_hdl -v2001 ../Source/Subsystem1_block180.v
read_hdl -v2001 ../Source/Subsystem1_block181.v
read_hdl -v2001 ../Source/Subsystem1_block182.v
read_hdl -v2001 ../Source/Subsystem1_block183.v
read_hdl -v2001 ../Source/Subsystem1_block184.v
read_hdl -v2001 ../Source/Subsystem1_block185.v
read_hdl -v2001 ../Source/Subsystem1_block186.v
read_hdl -v2001 ../Source/Subsystem1_block187.v
read_hdl -v2001 ../Source/Subsystem1_block188.v
read_hdl -v2001 ../Source/Subsystem1_block189.v
read_hdl -v2001 ../Source/Subsystem1_block190.v
read_hdl -v2001 ../Source/Subsystem1_block191.v
read_hdl -v2001 ../Source/Subsystem1_block192.v
read_hdl -v2001 ../Source/Subsystem1_block193.v
read_hdl -v2001 ../Source/Subsystem1_block194.v
read_hdl -v2001 ../Source/Subsystem1_block195.v
read_hdl -v2001 ../Source/Subsystem1_block196.v
read_hdl -v2001 ../Source/Subsystem1_block197.v
read_hdl -v2001 ../Source/Subsystem1_block198.v
read_hdl -v2001 ../Source/Subsystem1_block199.v
read_hdl -v2001 ../Source/Subsystem1_block200.v
read_hdl -v2001 ../Source/Subsystem1_block201.v
read_hdl -v2001 ../Source/Subsystem1_block202.v
read_hdl -v2001 ../Source/Subsystem1_block203.v
read_hdl -v2001 ../Source/Subsystem1_block204.v
read_hdl -v2001 ../Source/Subsystem1_block205.v
read_hdl -v2001 ../Source/Subsystem1_block206.v
read_hdl -v2001 ../Source/Subsystem1_block207.v
read_hdl -v2001 ../Source/Subsystem1_block208.v
read_hdl -v2001 ../Source/Subsystem1_block209.v
read_hdl -v2001 ../Source/Subsystem1_block210.v
read_hdl -v2001 ../Source/Subsystem1_block211.v
read_hdl -v2001 ../Source/Subsystem1_block212.v
read_hdl -v2001 ../Source/Subsystem1_block213.v
read_hdl -v2001 ../Source/Subsystem1_block214.v
read_hdl -v2001 ../Source/Subsystem1_block215.v
read_hdl -v2001 ../Source/Subsystem1_block216.v
read_hdl -v2001 ../Source/Subsystem1_block217.v
read_hdl -v2001 ../Source/Subsystem1_block218.v
read_hdl -v2001 ../Source/Subsystem1_block219.v
read_hdl -v2001 ../Source/Subsystem1_block220.v
read_hdl -v2001 ../Source/Subsystem1_block221.v
read_hdl -v2001 ../Source/Subsystem1_block222.v
read_hdl -v2001 ../Source/Subsystem1_block223.v
read_hdl -v2001 ../Source/Subsystem1_block224.v
read_hdl -v2001 ../Source/Subsystem1_block225.v
read_hdl -v2001 ../Source/Subsystem1_block226.v
read_hdl -v2001 ../Source/Subsystem1_block227.v
read_hdl -v2001 ../Source/Subsystem1_block228.v
read_hdl -v2001 ../Source/Subsystem1_block229.v
read_hdl -v2001 ../Source/Subsystem1_block230.v
read_hdl -v2001 ../Source/Subsystem1_block231.v
read_hdl -v2001 ../Source/Subsystem1_block232.v
read_hdl -v2001 ../Source/Subsystem1_block233.v
read_hdl -v2001 ../Source/Subsystem1_block234.v
read_hdl -v2001 ../Source/Subsystem1_block235.v
read_hdl -v2001 ../Source/Subsystem1_block236.v
read_hdl -v2001 ../Source/Subsystem1_block237.v
read_hdl -v2001 ../Source/Subsystem1_block238.v
read_hdl -v2001 ../Source/Subsystem1_block239.v
read_hdl -v2001 ../Source/Subsystem1_block240.v
read_hdl -v2001 ../Source/Subsystem1_block241.v
read_hdl -v2001 ../Source/Subsystem1_block242.v
read_hdl -v2001 ../Source/Subsystem1_block243.v
read_hdl -v2001 ../Source/Subsystem1_block244.v
read_hdl -v2001 ../Source/Subsystem1_block245.v
read_hdl -v2001 ../Source/Subsystem1_block246.v
read_hdl -v2001 ../Source/Subsystem1_block247.v
read_hdl -v2001 ../Source/Subsystem1_block248.v
read_hdl -v2001 ../Source/Subsystem1_block249.v
read_hdl -v2001 ../Source/Subsystem1_block250.v
read_hdl -v2001 ../Source/Subsystem1_block251.v
read_hdl -v2001 ../Source/Subsystem1_block252.v
read_hdl -v2001 ../Source/Subsystem1_block253.v
read_hdl -v2001 ../Source/Subsystem1_block254.v
read_hdl -v2001 ../Source/Subsystem1_block255.v
read_hdl -v2001 ../Source/Subsystem1_block256.v
read_hdl -v2001 ../Source/Subsystem1_block257.v
read_hdl -v2001 ../Source/Subsystem1_block258.v
read_hdl -v2001 ../Source/Subsystem1_block259.v
read_hdl -v2001 ../Source/Subsystem1_block260.v
read_hdl -v2001 ../Source/Subsystem1_block261.v
read_hdl -v2001 ../Source/Subsystem1_block262.v
read_hdl -v2001 ../Source/Subsystem1_block263.v
read_hdl -v2001 ../Source/Subsystem1_block264.v
read_hdl -v2001 ../Source/Subsystem1_block265.v
read_hdl -v2001 ../Source/Subsystem1_block266.v
read_hdl -v2001 ../Source/Subsystem1_block267.v
read_hdl -v2001 ../Source/Subsystem1_block268.v
read_hdl -v2001 ../Source/Subsystem1_block269.v
read_hdl -v2001 ../Source/Subsystem1_block270.v
read_hdl -v2001 ../Source/Subsystem1_block271.v
read_hdl -v2001 ../Source/Subsystem1_block272.v
read_hdl -v2001 ../Source/Subsystem1_block273.v
read_hdl -v2001 ../Source/Subsystem1_block274.v
read_hdl -v2001 ../Source/Subsystem1_block275.v
read_hdl -v2001 ../Source/Subsystem1_block276.v
read_hdl -v2001 ../Source/Subsystem1_block277.v
read_hdl -v2001 ../Source/Subsystem1_block278.v
read_hdl -v2001 ../Source/Subsystem1_block279.v
read_hdl -v2001 ../Source/Subsystem1_block280.v
read_hdl -v2001 ../Source/Subsystem1_block281.v
read_hdl -v2001 ../Source/Subsystem1_block282.v
read_hdl -v2001 ../Source/Subsystem1_block283.v
read_hdl -v2001 ../Source/Subsystem1_block284.v
read_hdl -v2001 ../Source/Subsystem1_block285.v
read_hdl -v2001 ../Source/Subsystem1_block286.v
read_hdl -v2001 ../Source/Subsystem1_block287.v
read_hdl -v2001 ../Source/Subsystem1_block288.v
read_hdl -v2001 ../Source/Subsystem1_block289.v
read_hdl -v2001 ../Source/Subsystem1_block290.v
read_hdl -v2001 ../Source/Subsystem1_block291.v
read_hdl -v2001 ../Source/Subsystem1_block292.v
read_hdl -v2001 ../Source/Subsystem1_block293.v
read_hdl -v2001 ../Source/Subsystem1_block294.v
read_hdl -v2001 ../Source/Subsystem1_block295.v
read_hdl -v2001 ../Source/Subsystem1_block296.v
read_hdl -v2001 ../Source/Subsystem1_block297.v
read_hdl -v2001 ../Source/Subsystem1_block298.v
read_hdl -v2001 ../Source/Subsystem1_block299.v
read_hdl -v2001 ../Source/Subsystem1_block300.v
read_hdl -v2001 ../Source/Subsystem1_block301.v
read_hdl -v2001 ../Source/Subsystem1_block302.v
read_hdl -v2001 ../Source/Subsystem1_block303.v
read_hdl -v2001 ../Source/Subsystem1_block304.v
read_hdl -v2001 ../Source/Subsystem1_block305.v
read_hdl -v2001 ../Source/Subsystem1_block306.v
read_hdl -v2001 ../Source/Subsystem1_block307.v
read_hdl -v2001 ../Source/Subsystem1_block308.v
read_hdl -v2001 ../Source/Subsystem1_block309.v
read_hdl -v2001 ../Source/Subsystem1_block310.v
read_hdl -v2001 ../Source/Subsystem1_block311.v
read_hdl -v2001 ../Source/Subsystem1_block312.v
read_hdl -v2001 ../Source/Subsystem1_block313.v
read_hdl -v2001 ../Source/Subsystem1_block314.v
read_hdl -v2001 ../Source/Subsystem1_block315.v
read_hdl -v2001 ../Source/Subsystem1_block316.v
read_hdl -v2001 ../Source/Subsystem1_block317.v
read_hdl -v2001 ../Source/Subsystem1_block318.v
read_hdl -v2001 ../Source/Subsystem1_block319.v
read_hdl -v2001 ../Source/Subsystem1_block320.v
read_hdl -v2001 ../Source/Subsystem1_block321.v
read_hdl -v2001 ../Source/Subsystem1_block322.v
read_hdl -v2001 ../Source/Subsystem1_block323.v
read_hdl -v2001 ../Source/Subsystem1_block324.v
read_hdl -v2001 ../Source/Subsystem1_block325.v
read_hdl -v2001 ../Source/Subsystem1_block326.v
read_hdl -v2001 ../Source/Subsystem1_block327.v
read_hdl -v2001 ../Source/Subsystem1_block328.v
read_hdl -v2001 ../Source/Subsystem1_block329.v
read_hdl -v2001 ../Source/Subsystem1_block330.v
read_hdl -v2001 ../Source/Subsystem1_block331.v
read_hdl -v2001 ../Source/Subsystem1_block332.v
read_hdl -v2001 ../Source/Subsystem1_block333.v
read_hdl -v2001 ../Source/Subsystem1_block334.v
read_hdl -v2001 ../Source/Subsystem1_block335.v
read_hdl -v2001 ../Source/Subsystem1_block336.v
read_hdl -v2001 ../Source/Subsystem1_block337.v
read_hdl -v2001 ../Source/Subsystem1_block338.v
read_hdl -v2001 ../Source/Subsystem1_block339.v
read_hdl -v2001 ../Source/Subsystem1_block340.v
read_hdl -v2001 ../Source/Subsystem1_block341.v
read_hdl -v2001 ../Source/Subsystem1_block342.v
read_hdl -v2001 ../Source/Subsystem1_block343.v
read_hdl -v2001 ../Source/Subsystem1_block344.v
read_hdl -v2001 ../Source/Subsystem1_block345.v
read_hdl -v2001 ../Source/Subsystem1_block346.v
read_hdl -v2001 ../Source/Subsystem1_block347.v
read_hdl -v2001 ../Source/Subsystem1_block348.v
read_hdl -v2001 ../Source/Subsystem1_block349.v
read_hdl -v2001 ../Source/Subsystem1_block350.v
read_hdl -v2001 ../Source/Subsystem1_block351.v
read_hdl -v2001 ../Source/Subsystem1_block352.v
read_hdl -v2001 ../Source/Subsystem1_block353.v
read_hdl -v2001 ../Source/Subsystem1_block354.v
read_hdl -v2001 ../Source/Subsystem1_block355.v
read_hdl -v2001 ../Source/Subsystem1_block356.v
read_hdl -v2001 ../Source/Subsystem1_block357.v
read_hdl -v2001 ../Source/Subsystem1_block358.v
read_hdl -v2001 ../Source/Subsystem1_block359.v
read_hdl -v2001 ../Source/Subsystem1_block360.v
read_hdl -v2001 ../Source/Subsystem1_block361.v
read_hdl -v2001 ../Source/Subsystem1_block362.v
read_hdl -v2001 ../Source/Subsystem1_block363.v
read_hdl -v2001 ../Source/Subsystem1_block364.v
read_hdl -v2001 ../Source/Subsystem1_block365.v
read_hdl -v2001 ../Source/Subsystem1_block366.v
read_hdl -v2001 ../Source/Subsystem1_block367.v
read_hdl -v2001 ../Source/Subsystem1_block368.v
read_hdl -v2001 ../Source/Subsystem1_block369.v
read_hdl -v2001 ../Source/Subsystem1_block370.v
read_hdl -v2001 ../Source/Subsystem1_block371.v
read_hdl -v2001 ../Source/Subsystem1_block372.v
read_hdl -v2001 ../Source/Subsystem1_block373.v
read_hdl -v2001 ../Source/Subsystem1_block374.v
read_hdl -v2001 ../Source/Subsystem1_block375.v
read_hdl -v2001 ../Source/Subsystem1_block376.v
read_hdl -v2001 ../Source/Subsystem1_block377.v
read_hdl -v2001 ../Source/Subsystem1_block378.v
read_hdl -v2001 ../Source/Subsystem1_block379.v
read_hdl -v2001 ../Source/Subsystem1_block380.v
read_hdl -v2001 ../Source/Subsystem1_block381.v
read_hdl -v2001 ../Source/Subsystem1_block382.v
read_hdl -v2001 ../Source/Subsystem_block.v
read_hdl -v2001 ../Source/Subsystem_block1.v
read_hdl -v2001 ../Source/Subsystem_block2.v
read_hdl -v2001 ../Source/Subsystem_block3.v
read_hdl -v2001 ../Source/Subsystem_block4.v
read_hdl -v2001 ../Source/Subsystem_block5.v
read_hdl -v2001 ../Source/Subsystem_block6.v
read_hdl -v2001 ../Source/Subsystem_block7.v
read_hdl -v2001 ../Source/Subsystem_block8.v
read_hdl -v2001 ../Source/Subsystem_block9.v
read_hdl -v2001 ../Source/Subsystem_block10.v
read_hdl -v2001 ../Source/Subsystem_block11.v
read_hdl -v2001 ../Source/Subsystem_block12.v
read_hdl -v2001 ../Source/Subsystem_block13.v
read_hdl -v2001 ../Source/Subsystem_block14.v
read_hdl -v2001 ../Source/Subsystem_block15.v
read_hdl -v2001 ../Source/Subsystem_block16.v
read_hdl -v2001 ../Source/Subsystem_block17.v
read_hdl -v2001 ../Source/Subsystem_block18.v
read_hdl -v2001 ../Source/Subsystem_block19.v
read_hdl -v2001 ../Source/Subsystem_block20.v
read_hdl -v2001 ../Source/Subsystem_block21.v
read_hdl -v2001 ../Source/Subsystem_block22.v
read_hdl -v2001 ../Source/Subsystem_block23.v
read_hdl -v2001 ../Source/Subsystem_block24.v
read_hdl -v2001 ../Source/Subsystem_block25.v
read_hdl -v2001 ../Source/Subsystem_block26.v
read_hdl -v2001 ../Source/Subsystem_block27.v
read_hdl -v2001 ../Source/Subsystem_block28.v
read_hdl -v2001 ../Source/Subsystem_block29.v
read_hdl -v2001 ../Source/Subsystem_block30.v
read_hdl -v2001 ../Source/Subsystem_block31.v
read_hdl -v2001 ../Source/Subsystem_block32.v
read_hdl -v2001 ../Source/Subsystem_block33.v
read_hdl -v2001 ../Source/Subsystem_block34.v
read_hdl -v2001 ../Source/Subsystem_block35.v
read_hdl -v2001 ../Source/Subsystem_block36.v
read_hdl -v2001 ../Source/Subsystem_block37.v
read_hdl -v2001 ../Source/Subsystem_block38.v
read_hdl -v2001 ../Source/Subsystem_block39.v
read_hdl -v2001 ../Source/Subsystem_block40.v
read_hdl -v2001 ../Source/Subsystem_block41.v
read_hdl -v2001 ../Source/Subsystem_block42.v
read_hdl -v2001 ../Source/Subsystem_block43.v
read_hdl -v2001 ../Source/Subsystem_block44.v
read_hdl -v2001 ../Source/Subsystem_block45.v
read_hdl -v2001 ../Source/Subsystem_block46.v
read_hdl -v2001 ../Source/Subsystem_block47.v
read_hdl -v2001 ../Source/Subsystem_block48.v
read_hdl -v2001 ../Source/Subsystem_block49.v
read_hdl -v2001 ../Source/Subsystem_block50.v
read_hdl -v2001 ../Source/Subsystem_block51.v
read_hdl -v2001 ../Source/Subsystem_block52.v
read_hdl -v2001 ../Source/Subsystem_block53.v
read_hdl -v2001 ../Source/Subsystem_block54.v
read_hdl -v2001 ../Source/Subsystem_block55.v
read_hdl -v2001 ../Source/Subsystem_block56.v
read_hdl -v2001 ../Source/Subsystem_block57.v
read_hdl -v2001 ../Source/Subsystem_block58.v
read_hdl -v2001 ../Source/Subsystem_block59.v
read_hdl -v2001 ../Source/Subsystem_block60.v
read_hdl -v2001 ../Source/Subsystem_block61.v
read_hdl -v2001 ../Source/Subsystem_block62.v

# Butterflies modules (stage 1)
read_hdl -v2001 ../Source/Butterfly_Stage1_1.v
read_hdl -v2001 ../Source/Butterfly_Stage1_2.v
read_hdl -v2001 ../Source/Butterfly_Stage1_3.v
read_hdl -v2001 ../Source/Butterfly_Stage1_4.v
read_hdl -v2001 ../Source/Butterfly_Stage1_5.v
read_hdl -v2001 ../Source/Butterfly_Stage1_6.v
read_hdl -v2001 ../Source/Butterfly_Stage1_7.v
read_hdl -v2001 ../Source/Butterfly_Stage1_8.v
read_hdl -v2001 ../Source/Butterfly_Stage1_9.v
read_hdl -v2001 ../Source/Butterfly_Stage1_10.v
read_hdl -v2001 ../Source/Butterfly_Stage1_11.v
read_hdl -v2001 ../Source/Butterfly_Stage1_12.v
read_hdl -v2001 ../Source/Butterfly_Stage1_13.v
read_hdl -v2001 ../Source/Butterfly_Stage1_14.v
read_hdl -v2001 ../Source/Butterfly_Stage1_15.v
read_hdl -v2001 ../Source/Butterfly_Stage1_16.v
read_hdl -v2001 ../Source/Butterfly_Stage1_17.v
read_hdl -v2001 ../Source/Butterfly_Stage1_18.v
read_hdl -v2001 ../Source/Butterfly_Stage1_19.v
read_hdl -v2001 ../Source/Butterfly_Stage1_20.v
read_hdl -v2001 ../Source/Butterfly_Stage1_21.v
read_hdl -v2001 ../Source/Butterfly_Stage1_22.v
read_hdl -v2001 ../Source/Butterfly_Stage1_23.v
read_hdl -v2001 ../Source/Butterfly_Stage1_24.v
read_hdl -v2001 ../Source/Butterfly_Stage1_25.v
read_hdl -v2001 ../Source/Butterfly_Stage1_26.v
read_hdl -v2001 ../Source/Butterfly_Stage1_27.v
read_hdl -v2001 ../Source/Butterfly_Stage1_28.v
read_hdl -v2001 ../Source/Butterfly_Stage1_29.v
read_hdl -v2001 ../Source/Butterfly_Stage1_30.v
read_hdl -v2001 ../Source/Butterfly_Stage1_31.v
read_hdl -v2001 ../Source/Butterfly_Stage1_32.v
read_hdl -v2001 ../Source/Butterfly_Stage1_33.v
read_hdl -v2001 ../Source/Butterfly_Stage1_34.v
read_hdl -v2001 ../Source/Butterfly_Stage1_35.v
read_hdl -v2001 ../Source/Butterfly_Stage1_36.v
read_hdl -v2001 ../Source/Butterfly_Stage1_37.v
read_hdl -v2001 ../Source/Butterfly_Stage1_38.v
read_hdl -v2001 ../Source/Butterfly_Stage1_39.v
read_hdl -v2001 ../Source/Butterfly_Stage1_40.v
read_hdl -v2001 ../Source/Butterfly_Stage1_41.v
read_hdl -v2001 ../Source/Butterfly_Stage1_42.v
read_hdl -v2001 ../Source/Butterfly_Stage1_43.v
read_hdl -v2001 ../Source/Butterfly_Stage1_44.v
read_hdl -v2001 ../Source/Butterfly_Stage1_45.v
read_hdl -v2001 ../Source/Butterfly_Stage1_46.v
read_hdl -v2001 ../Source/Butterfly_Stage1_47.v
read_hdl -v2001 ../Source/Butterfly_Stage1_48.v
read_hdl -v2001 ../Source/Butterfly_Stage1_49.v
read_hdl -v2001 ../Source/Butterfly_Stage1_50.v
read_hdl -v2001 ../Source/Butterfly_Stage1_51.v
read_hdl -v2001 ../Source/Butterfly_Stage1_52.v
read_hdl -v2001 ../Source/Butterfly_Stage1_53.v
read_hdl -v2001 ../Source/Butterfly_Stage1_54.v
read_hdl -v2001 ../Source/Butterfly_Stage1_55.v
read_hdl -v2001 ../Source/Butterfly_Stage1_56.v
read_hdl -v2001 ../Source/Butterfly_Stage1_57.v
read_hdl -v2001 ../Source/Butterfly_Stage1_58.v
read_hdl -v2001 ../Source/Butterfly_Stage1_59.v
read_hdl -v2001 ../Source/Butterfly_Stage1_60.v
read_hdl -v2001 ../Source/Butterfly_Stage1_61.v
read_hdl -v2001 ../Source/Butterfly_Stage1_62.v
read_hdl -v2001 ../Source/Butterfly_Stage1_63.v
read_hdl -v2001 ../Source/Butterfly_Stage1_64.v

# Butterflies modules (stage 2)
read_hdl -v2001 ../Source/Butterfly_Stage2_1.v
read_hdl -v2001 ../Source/Butterfly_Stage2_2.v
read_hdl -v2001 ../Source/Butterfly_Stage2_3.v
read_hdl -v2001 ../Source/Butterfly_Stage2_4.v
read_hdl -v2001 ../Source/Butterfly_Stage2_5.v
read_hdl -v2001 ../Source/Butterfly_Stage2_6.v
read_hdl -v2001 ../Source/Butterfly_Stage2_7.v
read_hdl -v2001 ../Source/Butterfly_Stage2_8.v
read_hdl -v2001 ../Source/Butterfly_Stage2_9.v
read_hdl -v2001 ../Source/Butterfly_Stage2_10.v
read_hdl -v2001 ../Source/Butterfly_Stage2_11.v
read_hdl -v2001 ../Source/Butterfly_Stage2_12.v
read_hdl -v2001 ../Source/Butterfly_Stage2_13.v
read_hdl -v2001 ../Source/Butterfly_Stage2_14.v
read_hdl -v2001 ../Source/Butterfly_Stage2_15.v
read_hdl -v2001 ../Source/Butterfly_Stage2_16.v
read_hdl -v2001 ../Source/Butterfly_Stage2_17.v
read_hdl -v2001 ../Source/Butterfly_Stage2_18.v
read_hdl -v2001 ../Source/Butterfly_Stage2_19.v
read_hdl -v2001 ../Source/Butterfly_Stage2_20.v
read_hdl -v2001 ../Source/Butterfly_Stage2_21.v
read_hdl -v2001 ../Source/Butterfly_Stage2_22.v
read_hdl -v2001 ../Source/Butterfly_Stage2_23.v
read_hdl -v2001 ../Source/Butterfly_Stage2_24.v
read_hdl -v2001 ../Source/Butterfly_Stage2_25.v
read_hdl -v2001 ../Source/Butterfly_Stage2_26.v
read_hdl -v2001 ../Source/Butterfly_Stage2_27.v
read_hdl -v2001 ../Source/Butterfly_Stage2_28.v
read_hdl -v2001 ../Source/Butterfly_Stage2_29.v
read_hdl -v2001 ../Source/Butterfly_Stage2_30.v
read_hdl -v2001 ../Source/Butterfly_Stage2_31.v
read_hdl -v2001 ../Source/Butterfly_Stage2_32.v
read_hdl -v2001 ../Source/Butterfly_Stage2_33.v
read_hdl -v2001 ../Source/Butterfly_Stage2_34.v
read_hdl -v2001 ../Source/Butterfly_Stage2_35.v
read_hdl -v2001 ../Source/Butterfly_Stage2_36.v
read_hdl -v2001 ../Source/Butterfly_Stage2_37.v
read_hdl -v2001 ../Source/Butterfly_Stage2_38.v
read_hdl -v2001 ../Source/Butterfly_Stage2_39.v
read_hdl -v2001 ../Source/Butterfly_Stage2_40.v
read_hdl -v2001 ../Source/Butterfly_Stage2_41.v
read_hdl -v2001 ../Source/Butterfly_Stage2_42.v
read_hdl -v2001 ../Source/Butterfly_Stage2_43.v
read_hdl -v2001 ../Source/Butterfly_Stage2_44.v
read_hdl -v2001 ../Source/Butterfly_Stage2_45.v
read_hdl -v2001 ../Source/Butterfly_Stage2_46.v
read_hdl -v2001 ../Source/Butterfly_Stage2_47.v
read_hdl -v2001 ../Source/Butterfly_Stage2_48.v
read_hdl -v2001 ../Source/Butterfly_Stage2_49.v
read_hdl -v2001 ../Source/Butterfly_Stage2_50.v
read_hdl -v2001 ../Source/Butterfly_Stage2_51.v
read_hdl -v2001 ../Source/Butterfly_Stage2_52.v
read_hdl -v2001 ../Source/Butterfly_Stage2_53.v
read_hdl -v2001 ../Source/Butterfly_Stage2_54.v
read_hdl -v2001 ../Source/Butterfly_Stage2_55.v
read_hdl -v2001 ../Source/Butterfly_Stage2_56.v
read_hdl -v2001 ../Source/Butterfly_Stage2_57.v
read_hdl -v2001 ../Source/Butterfly_Stage2_58.v
read_hdl -v2001 ../Source/Butterfly_Stage2_59.v
read_hdl -v2001 ../Source/Butterfly_Stage2_60.v
read_hdl -v2001 ../Source/Butterfly_Stage2_61.v
read_hdl -v2001 ../Source/Butterfly_Stage2_62.v
read_hdl -v2001 ../Source/Butterfly_Stage2_63.v
read_hdl -v2001 ../Source/Butterfly_Stage2_64.v

# Butterflies modules (stage 3)
read_hdl -v2001 ../Source/Butterfly_Stage3_1.v
read_hdl -v2001 ../Source/Butterfly_Stage3_2.v
read_hdl -v2001 ../Source/Butterfly_Stage3_3.v
read_hdl -v2001 ../Source/Butterfly_Stage3_4.v
read_hdl -v2001 ../Source/Butterfly_Stage3_5.v
read_hdl -v2001 ../Source/Butterfly_Stage3_6.v
read_hdl -v2001 ../Source/Butterfly_Stage3_7.v
read_hdl -v2001 ../Source/Butterfly_Stage3_8.v
read_hdl -v2001 ../Source/Butterfly_Stage3_9.v
read_hdl -v2001 ../Source/Butterfly_Stage3_10.v
read_hdl -v2001 ../Source/Butterfly_Stage3_11.v
read_hdl -v2001 ../Source/Butterfly_Stage3_12.v
read_hdl -v2001 ../Source/Butterfly_Stage3_13.v
read_hdl -v2001 ../Source/Butterfly_Stage3_14.v
read_hdl -v2001 ../Source/Butterfly_Stage3_15.v
read_hdl -v2001 ../Source/Butterfly_Stage3_16.v
read_hdl -v2001 ../Source/Butterfly_Stage3_17.v
read_hdl -v2001 ../Source/Butterfly_Stage3_18.v
read_hdl -v2001 ../Source/Butterfly_Stage3_19.v
read_hdl -v2001 ../Source/Butterfly_Stage3_20.v
read_hdl -v2001 ../Source/Butterfly_Stage3_21.v
read_hdl -v2001 ../Source/Butterfly_Stage3_22.v
read_hdl -v2001 ../Source/Butterfly_Stage3_23.v
read_hdl -v2001 ../Source/Butterfly_Stage3_24.v
read_hdl -v2001 ../Source/Butterfly_Stage3_25.v
read_hdl -v2001 ../Source/Butterfly_Stage3_26.v
read_hdl -v2001 ../Source/Butterfly_Stage3_27.v
read_hdl -v2001 ../Source/Butterfly_Stage3_28.v
read_hdl -v2001 ../Source/Butterfly_Stage3_29.v
read_hdl -v2001 ../Source/Butterfly_Stage3_30.v
read_hdl -v2001 ../Source/Butterfly_Stage3_31.v
read_hdl -v2001 ../Source/Butterfly_Stage3_32.v
read_hdl -v2001 ../Source/Butterfly_Stage3_33.v
read_hdl -v2001 ../Source/Butterfly_Stage3_34.v
read_hdl -v2001 ../Source/Butterfly_Stage3_35.v
read_hdl -v2001 ../Source/Butterfly_Stage3_36.v
read_hdl -v2001 ../Source/Butterfly_Stage3_37.v
read_hdl -v2001 ../Source/Butterfly_Stage3_38.v
read_hdl -v2001 ../Source/Butterfly_Stage3_39.v
read_hdl -v2001 ../Source/Butterfly_Stage3_40.v
read_hdl -v2001 ../Source/Butterfly_Stage3_41.v
read_hdl -v2001 ../Source/Butterfly_Stage3_42.v
read_hdl -v2001 ../Source/Butterfly_Stage3_43.v
read_hdl -v2001 ../Source/Butterfly_Stage3_44.v
read_hdl -v2001 ../Source/Butterfly_Stage3_45.v
read_hdl -v2001 ../Source/Butterfly_Stage3_46.v
read_hdl -v2001 ../Source/Butterfly_Stage3_47.v
read_hdl -v2001 ../Source/Butterfly_Stage3_48.v
read_hdl -v2001 ../Source/Butterfly_Stage3_49.v
read_hdl -v2001 ../Source/Butterfly_Stage3_50.v
read_hdl -v2001 ../Source/Butterfly_Stage3_51.v
read_hdl -v2001 ../Source/Butterfly_Stage3_52.v
read_hdl -v2001 ../Source/Butterfly_Stage3_53.v
read_hdl -v2001 ../Source/Butterfly_Stage3_54.v
read_hdl -v2001 ../Source/Butterfly_Stage3_55.v
read_hdl -v2001 ../Source/Butterfly_Stage3_56.v
read_hdl -v2001 ../Source/Butterfly_Stage3_57.v
read_hdl -v2001 ../Source/Butterfly_Stage3_58.v
read_hdl -v2001 ../Source/Butterfly_Stage3_59.v
read_hdl -v2001 ../Source/Butterfly_Stage3_60.v
read_hdl -v2001 ../Source/Butterfly_Stage3_61.v
read_hdl -v2001 ../Source/Butterfly_Stage3_62.v
read_hdl -v2001 ../Source/Butterfly_Stage3_63.v
read_hdl -v2001 ../Source/Butterfly_Stage3_64.v

# Butterflies modules (stage 4)
read_hdl -v2001 ../Source/Butterfly_Stage4_1.v
read_hdl -v2001 ../Source/Butterfly_Stage4_2.v
read_hdl -v2001 ../Source/Butterfly_Stage4_3.v
read_hdl -v2001 ../Source/Butterfly_Stage4_4.v
read_hdl -v2001 ../Source/Butterfly_Stage4_5.v
read_hdl -v2001 ../Source/Butterfly_Stage4_6.v
read_hdl -v2001 ../Source/Butterfly_Stage4_7.v
read_hdl -v2001 ../Source/Butterfly_Stage4_8.v
read_hdl -v2001 ../Source/Butterfly_Stage4_9.v
read_hdl -v2001 ../Source/Butterfly_Stage4_10.v
read_hdl -v2001 ../Source/Butterfly_Stage4_11.v
read_hdl -v2001 ../Source/Butterfly_Stage4_12.v
read_hdl -v2001 ../Source/Butterfly_Stage4_13.v
read_hdl -v2001 ../Source/Butterfly_Stage4_14.v
read_hdl -v2001 ../Source/Butterfly_Stage4_15.v
read_hdl -v2001 ../Source/Butterfly_Stage4_16.v
read_hdl -v2001 ../Source/Butterfly_Stage4_17.v
read_hdl -v2001 ../Source/Butterfly_Stage4_18.v
read_hdl -v2001 ../Source/Butterfly_Stage4_19.v
read_hdl -v2001 ../Source/Butterfly_Stage4_20.v
read_hdl -v2001 ../Source/Butterfly_Stage4_21.v
read_hdl -v2001 ../Source/Butterfly_Stage4_22.v
read_hdl -v2001 ../Source/Butterfly_Stage4_23.v
read_hdl -v2001 ../Source/Butterfly_Stage4_24.v
read_hdl -v2001 ../Source/Butterfly_Stage4_25.v
read_hdl -v2001 ../Source/Butterfly_Stage4_26.v
read_hdl -v2001 ../Source/Butterfly_Stage4_27.v
read_hdl -v2001 ../Source/Butterfly_Stage4_28.v
read_hdl -v2001 ../Source/Butterfly_Stage4_29.v
read_hdl -v2001 ../Source/Butterfly_Stage4_30.v
read_hdl -v2001 ../Source/Butterfly_Stage4_31.v
read_hdl -v2001 ../Source/Butterfly_Stage4_32.v
read_hdl -v2001 ../Source/Butterfly_Stage4_33.v
read_hdl -v2001 ../Source/Butterfly_Stage4_34.v
read_hdl -v2001 ../Source/Butterfly_Stage4_35.v
read_hdl -v2001 ../Source/Butterfly_Stage4_36.v
read_hdl -v2001 ../Source/Butterfly_Stage4_37.v
read_hdl -v2001 ../Source/Butterfly_Stage4_38.v
read_hdl -v2001 ../Source/Butterfly_Stage4_39.v
read_hdl -v2001 ../Source/Butterfly_Stage4_40.v
read_hdl -v2001 ../Source/Butterfly_Stage4_41.v
read_hdl -v2001 ../Source/Butterfly_Stage4_42.v
read_hdl -v2001 ../Source/Butterfly_Stage4_43.v
read_hdl -v2001 ../Source/Butterfly_Stage4_44.v
read_hdl -v2001 ../Source/Butterfly_Stage4_45.v
read_hdl -v2001 ../Source/Butterfly_Stage4_46.v
read_hdl -v2001 ../Source/Butterfly_Stage4_47.v
read_hdl -v2001 ../Source/Butterfly_Stage4_48.v
read_hdl -v2001 ../Source/Butterfly_Stage4_49.v
read_hdl -v2001 ../Source/Butterfly_Stage4_50.v
read_hdl -v2001 ../Source/Butterfly_Stage4_51.v
read_hdl -v2001 ../Source/Butterfly_Stage4_52.v
read_hdl -v2001 ../Source/Butterfly_Stage4_53.v
read_hdl -v2001 ../Source/Butterfly_Stage4_54.v
read_hdl -v2001 ../Source/Butterfly_Stage4_55.v
read_hdl -v2001 ../Source/Butterfly_Stage4_56.v
read_hdl -v2001 ../Source/Butterfly_Stage4_57.v
read_hdl -v2001 ../Source/Butterfly_Stage4_58.v
read_hdl -v2001 ../Source/Butterfly_Stage4_59.v
read_hdl -v2001 ../Source/Butterfly_Stage4_60.v
read_hdl -v2001 ../Source/Butterfly_Stage4_61.v
read_hdl -v2001 ../Source/Butterfly_Stage4_62.v
read_hdl -v2001 ../Source/Butterfly_Stage4_63.v
read_hdl -v2001 ../Source/Butterfly_Stage4_64.v

# Butterflies modules (stage 5)
read_hdl -v2001 ../Source/Butterfly_Stage5_1.v
read_hdl -v2001 ../Source/Butterfly_Stage5_2.v
read_hdl -v2001 ../Source/Butterfly_Stage5_3.v
read_hdl -v2001 ../Source/Butterfly_Stage5_4.v
read_hdl -v2001 ../Source/Butterfly_Stage5_5.v
read_hdl -v2001 ../Source/Butterfly_Stage5_6.v
read_hdl -v2001 ../Source/Butterfly_Stage5_7.v
read_hdl -v2001 ../Source/Butterfly_Stage5_8.v
read_hdl -v2001 ../Source/Butterfly_Stage5_9.v
read_hdl -v2001 ../Source/Butterfly_Stage5_10.v
read_hdl -v2001 ../Source/Butterfly_Stage5_11.v
read_hdl -v2001 ../Source/Butterfly_Stage5_12.v
read_hdl -v2001 ../Source/Butterfly_Stage5_13.v
read_hdl -v2001 ../Source/Butterfly_Stage5_14.v
read_hdl -v2001 ../Source/Butterfly_Stage5_15.v
read_hdl -v2001 ../Source/Butterfly_Stage5_16.v
read_hdl -v2001 ../Source/Butterfly_Stage5_17.v
read_hdl -v2001 ../Source/Butterfly_Stage5_18.v
read_hdl -v2001 ../Source/Butterfly_Stage5_19.v
read_hdl -v2001 ../Source/Butterfly_Stage5_20.v
read_hdl -v2001 ../Source/Butterfly_Stage5_21.v
read_hdl -v2001 ../Source/Butterfly_Stage5_22.v
read_hdl -v2001 ../Source/Butterfly_Stage5_23.v
read_hdl -v2001 ../Source/Butterfly_Stage5_24.v
read_hdl -v2001 ../Source/Butterfly_Stage5_25.v
read_hdl -v2001 ../Source/Butterfly_Stage5_26.v
read_hdl -v2001 ../Source/Butterfly_Stage5_27.v
read_hdl -v2001 ../Source/Butterfly_Stage5_28.v
read_hdl -v2001 ../Source/Butterfly_Stage5_29.v
read_hdl -v2001 ../Source/Butterfly_Stage5_30.v
read_hdl -v2001 ../Source/Butterfly_Stage5_31.v
read_hdl -v2001 ../Source/Butterfly_Stage5_32.v
read_hdl -v2001 ../Source/Butterfly_Stage5_33.v
read_hdl -v2001 ../Source/Butterfly_Stage5_34.v
read_hdl -v2001 ../Source/Butterfly_Stage5_35.v
read_hdl -v2001 ../Source/Butterfly_Stage5_36.v
read_hdl -v2001 ../Source/Butterfly_Stage5_37.v
read_hdl -v2001 ../Source/Butterfly_Stage5_38.v
read_hdl -v2001 ../Source/Butterfly_Stage5_39.v
read_hdl -v2001 ../Source/Butterfly_Stage5_40.v
read_hdl -v2001 ../Source/Butterfly_Stage5_41.v
read_hdl -v2001 ../Source/Butterfly_Stage5_42.v
read_hdl -v2001 ../Source/Butterfly_Stage5_43.v
read_hdl -v2001 ../Source/Butterfly_Stage5_44.v
read_hdl -v2001 ../Source/Butterfly_Stage5_45.v
read_hdl -v2001 ../Source/Butterfly_Stage5_46.v
read_hdl -v2001 ../Source/Butterfly_Stage5_47.v
read_hdl -v2001 ../Source/Butterfly_Stage5_48.v
read_hdl -v2001 ../Source/Butterfly_Stage5_49.v
read_hdl -v2001 ../Source/Butterfly_Stage5_50.v
read_hdl -v2001 ../Source/Butterfly_Stage5_51.v
read_hdl -v2001 ../Source/Butterfly_Stage5_52.v
read_hdl -v2001 ../Source/Butterfly_Stage5_53.v
read_hdl -v2001 ../Source/Butterfly_Stage5_54.v
read_hdl -v2001 ../Source/Butterfly_Stage5_55.v
read_hdl -v2001 ../Source/Butterfly_Stage5_56.v
read_hdl -v2001 ../Source/Butterfly_Stage5_57.v
read_hdl -v2001 ../Source/Butterfly_Stage5_58.v
read_hdl -v2001 ../Source/Butterfly_Stage5_59.v
read_hdl -v2001 ../Source/Butterfly_Stage5_60.v
read_hdl -v2001 ../Source/Butterfly_Stage5_61.v
read_hdl -v2001 ../Source/Butterfly_Stage5_62.v
read_hdl -v2001 ../Source/Butterfly_Stage5_63.v
read_hdl -v2001 ../Source/Butterfly_Stage5_64.v

# Butterflies modules (stage 6)
read_hdl -v2001 ../Source/Butterfly_Stage6_1.v
read_hdl -v2001 ../Source/Butterfly_Stage6_2.v
read_hdl -v2001 ../Source/Butterfly_Stage6_3.v
read_hdl -v2001 ../Source/Butterfly_Stage6_4.v
read_hdl -v2001 ../Source/Butterfly_Stage6_5.v
read_hdl -v2001 ../Source/Butterfly_Stage6_6.v
read_hdl -v2001 ../Source/Butterfly_Stage6_7.v
read_hdl -v2001 ../Source/Butterfly_Stage6_8.v
read_hdl -v2001 ../Source/Butterfly_Stage6_9.v
read_hdl -v2001 ../Source/Butterfly_Stage6_10.v
read_hdl -v2001 ../Source/Butterfly_Stage6_11.v
read_hdl -v2001 ../Source/Butterfly_Stage6_12.v
read_hdl -v2001 ../Source/Butterfly_Stage6_13.v
read_hdl -v2001 ../Source/Butterfly_Stage6_14.v
read_hdl -v2001 ../Source/Butterfly_Stage6_15.v
read_hdl -v2001 ../Source/Butterfly_Stage6_16.v
read_hdl -v2001 ../Source/Butterfly_Stage6_17.v
read_hdl -v2001 ../Source/Butterfly_Stage6_18.v
read_hdl -v2001 ../Source/Butterfly_Stage6_19.v
read_hdl -v2001 ../Source/Butterfly_Stage6_20.v
read_hdl -v2001 ../Source/Butterfly_Stage6_21.v
read_hdl -v2001 ../Source/Butterfly_Stage6_22.v
read_hdl -v2001 ../Source/Butterfly_Stage6_23.v
read_hdl -v2001 ../Source/Butterfly_Stage6_24.v
read_hdl -v2001 ../Source/Butterfly_Stage6_25.v
read_hdl -v2001 ../Source/Butterfly_Stage6_26.v
read_hdl -v2001 ../Source/Butterfly_Stage6_27.v
read_hdl -v2001 ../Source/Butterfly_Stage6_28.v
read_hdl -v2001 ../Source/Butterfly_Stage6_29.v
read_hdl -v2001 ../Source/Butterfly_Stage6_30.v
read_hdl -v2001 ../Source/Butterfly_Stage6_31.v
read_hdl -v2001 ../Source/Butterfly_Stage6_32.v
read_hdl -v2001 ../Source/Butterfly_Stage6_33.v
read_hdl -v2001 ../Source/Butterfly_Stage6_34.v
read_hdl -v2001 ../Source/Butterfly_Stage6_35.v
read_hdl -v2001 ../Source/Butterfly_Stage6_36.v
read_hdl -v2001 ../Source/Butterfly_Stage6_37.v
read_hdl -v2001 ../Source/Butterfly_Stage6_38.v
read_hdl -v2001 ../Source/Butterfly_Stage6_39.v
read_hdl -v2001 ../Source/Butterfly_Stage6_40.v
read_hdl -v2001 ../Source/Butterfly_Stage6_41.v
read_hdl -v2001 ../Source/Butterfly_Stage6_42.v
read_hdl -v2001 ../Source/Butterfly_Stage6_43.v
read_hdl -v2001 ../Source/Butterfly_Stage6_44.v
read_hdl -v2001 ../Source/Butterfly_Stage6_45.v
read_hdl -v2001 ../Source/Butterfly_Stage6_46.v
read_hdl -v2001 ../Source/Butterfly_Stage6_47.v
read_hdl -v2001 ../Source/Butterfly_Stage6_48.v
read_hdl -v2001 ../Source/Butterfly_Stage6_49.v
read_hdl -v2001 ../Source/Butterfly_Stage6_50.v
read_hdl -v2001 ../Source/Butterfly_Stage6_51.v
read_hdl -v2001 ../Source/Butterfly_Stage6_52.v
read_hdl -v2001 ../Source/Butterfly_Stage6_53.v
read_hdl -v2001 ../Source/Butterfly_Stage6_54.v
read_hdl -v2001 ../Source/Butterfly_Stage6_55.v
read_hdl -v2001 ../Source/Butterfly_Stage6_56.v
read_hdl -v2001 ../Source/Butterfly_Stage6_57.v
read_hdl -v2001 ../Source/Butterfly_Stage6_58.v
read_hdl -v2001 ../Source/Butterfly_Stage6_59.v
read_hdl -v2001 ../Source/Butterfly_Stage6_60.v
read_hdl -v2001 ../Source/Butterfly_Stage6_61.v
read_hdl -v2001 ../Source/Butterfly_Stage6_62.v
read_hdl -v2001 ../Source/Butterfly_Stage6_63.v
read_hdl -v2001 ../Source/Butterfly_Stage6_64.v

# Butterflies modules (stage 7)
read_hdl -v2001 ../Source/Butterfly_Stage7_1.v
read_hdl -v2001 ../Source/Butterfly_Stage7_2.v
read_hdl -v2001 ../Source/Butterfly_Stage7_3.v
read_hdl -v2001 ../Source/Butterfly_Stage7_4.v
read_hdl -v2001 ../Source/Butterfly_Stage7_5.v
read_hdl -v2001 ../Source/Butterfly_Stage7_6.v
read_hdl -v2001 ../Source/Butterfly_Stage7_7.v
read_hdl -v2001 ../Source/Butterfly_Stage7_8.v
read_hdl -v2001 ../Source/Butterfly_Stage7_9.v
read_hdl -v2001 ../Source/Butterfly_Stage7_10.v
read_hdl -v2001 ../Source/Butterfly_Stage7_11.v
read_hdl -v2001 ../Source/Butterfly_Stage7_12.v
read_hdl -v2001 ../Source/Butterfly_Stage7_13.v
read_hdl -v2001 ../Source/Butterfly_Stage7_14.v
read_hdl -v2001 ../Source/Butterfly_Stage7_15.v
read_hdl -v2001 ../Source/Butterfly_Stage7_16.v
read_hdl -v2001 ../Source/Butterfly_Stage7_17.v
read_hdl -v2001 ../Source/Butterfly_Stage7_18.v
read_hdl -v2001 ../Source/Butterfly_Stage7_19.v
read_hdl -v2001 ../Source/Butterfly_Stage7_20.v
read_hdl -v2001 ../Source/Butterfly_Stage7_21.v
read_hdl -v2001 ../Source/Butterfly_Stage7_22.v
read_hdl -v2001 ../Source/Butterfly_Stage7_23.v
read_hdl -v2001 ../Source/Butterfly_Stage7_24.v
read_hdl -v2001 ../Source/Butterfly_Stage7_25.v
read_hdl -v2001 ../Source/Butterfly_Stage7_26.v
read_hdl -v2001 ../Source/Butterfly_Stage7_27.v
read_hdl -v2001 ../Source/Butterfly_Stage7_28.v
read_hdl -v2001 ../Source/Butterfly_Stage7_29.v
read_hdl -v2001 ../Source/Butterfly_Stage7_30.v
read_hdl -v2001 ../Source/Butterfly_Stage7_31.v
read_hdl -v2001 ../Source/Butterfly_Stage7_32.v
read_hdl -v2001 ../Source/Butterfly_Stage7_33.v
read_hdl -v2001 ../Source/Butterfly_Stage7_34.v
read_hdl -v2001 ../Source/Butterfly_Stage7_35.v
read_hdl -v2001 ../Source/Butterfly_Stage7_36.v
read_hdl -v2001 ../Source/Butterfly_Stage7_37.v
read_hdl -v2001 ../Source/Butterfly_Stage7_38.v
read_hdl -v2001 ../Source/Butterfly_Stage7_39.v
read_hdl -v2001 ../Source/Butterfly_Stage7_40.v
read_hdl -v2001 ../Source/Butterfly_Stage7_41.v
read_hdl -v2001 ../Source/Butterfly_Stage7_42.v
read_hdl -v2001 ../Source/Butterfly_Stage7_43.v
read_hdl -v2001 ../Source/Butterfly_Stage7_44.v
read_hdl -v2001 ../Source/Butterfly_Stage7_45.v
read_hdl -v2001 ../Source/Butterfly_Stage7_46.v
read_hdl -v2001 ../Source/Butterfly_Stage7_47.v
read_hdl -v2001 ../Source/Butterfly_Stage7_48.v
read_hdl -v2001 ../Source/Butterfly_Stage7_49.v
read_hdl -v2001 ../Source/Butterfly_Stage7_50.v
read_hdl -v2001 ../Source/Butterfly_Stage7_51.v
read_hdl -v2001 ../Source/Butterfly_Stage7_52.v
read_hdl -v2001 ../Source/Butterfly_Stage7_53.v
read_hdl -v2001 ../Source/Butterfly_Stage7_54.v
read_hdl -v2001 ../Source/Butterfly_Stage7_55.v
read_hdl -v2001 ../Source/Butterfly_Stage7_56.v
read_hdl -v2001 ../Source/Butterfly_Stage7_57.v
read_hdl -v2001 ../Source/Butterfly_Stage7_58.v
read_hdl -v2001 ../Source/Butterfly_Stage7_59.v
read_hdl -v2001 ../Source/Butterfly_Stage7_60.v
read_hdl -v2001 ../Source/Butterfly_Stage7_61.v
read_hdl -v2001 ../Source/Butterfly_Stage7_62.v
read_hdl -v2001 ../Source/Butterfly_Stage7_63.v
read_hdl -v2001 ../Source/Butterfly_Stage7_64.v

# Top module (128-point FFT)
read_hdl -v2001 ../Source/FFTblock_FP_libblocks.v

## Compile our code (create a technology-independent schematic)
elaborate -parameters $PARAMS $DESIGN

## Setup design constraints
read_sdc ../Source/Constraints.sdc

## Synthesize our schematic (create a technology-dependent schematic)
synthesize -to_mapped
synthesize -incremental

## Write out area and timing reports
report timing > ../Reports/Top_synth_timing_report_typ
report area > ../Reports/Top_synth_area_report_typ

## Write out synthesized Verilog netlist
write_hdl -mapped > ../Source/FFTblock_FP_libblocks_synth_typ.v

## Write out the SDC file we will take into the place n route tool
write_sdc > ../Source/Constraints_synth_typ.sdc

gui_show

